TexasInstruments/mcupsdk-core/examples/pru_io/sent/decoder_pruicss_iep_ecap/example/am263x-cc/r5fss0-0_freertos/example.syscfg
section1.load_memory                  = "R5F_VECS";
section1.group                        = false;
section1.$name                        = "Vector Table";
section1.output_section.create(1);
section1.output_section[0].$name      = ".vectors";
section1.output_section[0].palignment = true;

section2.load_memory                  = "OCRAM";
section2.$name                        = "Text Segments";
section2.output_section.create(5);
section2.output_section[0].$name      = ".text.hwi";
section2.output_section[0].palignment = true;
section2.output_section[1].$name      = ".text.cache";
section2.output_section[1].palignment = true;
section2.output_section[2].$name      = ".text.mpu";
section2.output_section[2].palignment = true;
section2.output_section[3].$name      = ".text.boot";
section2.output_section[3].palignment = true;
section2.output_section[4].$name      = ".text:abort";
section2.output_section[4].palignment = true;

section3.load_memory                  = "OCRAM";
section3.$name                        = "Code and Read-Only Data";
section3.output_section.create(2);
section3.output_section[0].$name      = ".text";
section3.output_section[0].palignment = true;
section3.output_section[1].$name      = ".rodata";
section3.output_section[1].palignment = true;

section4.load_memory                  = "OCRAM";
section4.$name                        = "Data Segment";
section4.output_section.create(1);
section4.output_section[0].$name      = ".data";
section4.output_section[0].palignment = true;

section5.load_memory                             = "OCRAM";
section5.$name                                   = "Memory Segments";
section5.output_section.create(3);
section5.output_section[0].$name                 = ".bss";
section5.output_section[0].output_sections_start = "__BSS_START";
section5.output_section[0].output_sections_end   = "__BSS_END";
section5.output_section[0].palignment            = true;
section5.output_section[1].$name                 = ".sysmem";
section5.output_section[1].palignment            = true;
section5.output_section[2].$name                 = ".stack";
section5.output_section[2].palignment            = true;

section6.load_memory                              = "OCRAM";
section6.$name                                    = "Stack Segments";
section6.output_section.create(5);
section6.output_section[0].$name                  = ".irqstack";
section6.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section6.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section6.output_section[0].input_section.create(1);
section6.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section6.output_section[1].$name                  = ".fiqstack";
section6.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section6.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section6.output_section[1].input_section.create(1);
section6.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section6.output_section[2].$name                  = ".svcstack";
section6.output_section[2].output_sections_start  = "__SVC_STACK_START";
section6.output_section[2].output_sections_end    = "__SVC_STACK_END";
section6.output_section[2].input_section.create(1);
section6.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section6.output_section[3].$name                  = ".abortstack";
section6.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section6.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section6.output_section[3].input_section.create(1);
section6.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section6.output_section[4].$name                  = ".undefinedstack";
section6.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section6.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section6.output_section[4].input_section.create(1);
section6.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section7.load_memory                  = "OCRAM";
section7.$name                        = "Initialization and Exception Handling";
section7.output_section.create(3);
section7.output_section[0].$name      = ".ARM.exidx";
section7.output_section[0].palignment = true;
section7.output_section[1].$name      = ".init_array";
section7.output_section[1].palignment = true;
section7.output_section[2].$name      = ".fini_array";
section7.output_section[2].palignment = true;

section8.load_memory                 = "USER_SHM_MEM";
section8.type                        = "NOLOAD";
section8.$name                       = "User Shared Memory";
section8.group                       = false;
section8.output_section.create(1);
section8.output_section[0].$name     = ".bss.user_shared_mem";
section8.output_section[0].alignment = 0;

section9.load_memory                 = "LOG_SHM_MEM";
section9.$name                       = "Log Shared Memory";
section9.group                       = false;
section9.type                        = "NOLOAD";
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.log_shared_mem";
section9.output_section[0].alignment = 0;

section10.load_memory                 = "RTOS_NORTOS_IPC_SHM_MEM";
section10.type                        = "NOLOAD";
section10.$name                       = "IPC Shared Memory";
section10.group                       = false;
section10.output_section.create(1);
section10.output_section[0].$name     = ".bss.ipc_vring_mem";
section10.output_section[0].alignment = 0;

section11.load_memory                 = "MAILBOX_HSM";
section11.type                        = "NOLOAD";
section11.$name                       = "SIPC HSM Queue Memory";
section11.group                       = false;
section11.output_section.create(1);
section11.output_section[0].$name     = ".bss.sipc_hsm_queue_mem";
section11.output_section[0].alignment = 0;

section12.load_memory                 = "MAILBOX_R5F";
section12.$name                       = "SIPC R5F Queue Memory";
section12.group                       = false;
section12.type                        = "NOLOAD";
section12.output_section.create(1);
section12.output_section[0].$name     = ".bss.sipc_secure_host_queue_mem";
section12.output_section[0].alignment = 0;

soc_timesync_xbar11.xbarOutput          = "GPIO_INT_XBAR_GPIO_MUX_93";
soc_timesync_xbar11.instance            = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_2";
soc_timesync_xbar11.$name               = "CONFIG_GPIO93_SYNCEV10_CAP0";
soc_timesync_xbar11.xbarConfig.$name    = "CONFIG_GPIO_INT_XBAR0";
soc_timesync_xbar11.xbarConfig.instance = "GPIO_INT_XBAR_SOC_TIMESYNC_XBAR1_0";

soc_timesync_xbar12.xbarOutput          = "GPIO_INT_XBAR_GPIO_MUX_94";
soc_timesync_xbar12.instance            = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_3";
soc_timesync_xbar12.$name               = "CONFIG_GPIO94_SYNCEV11_CAP1";
soc_timesync_xbar12.xbarConfig.$name    = "CONFIG_GPIO_INT_XBAR1";
soc_timesync_xbar12.xbarConfig.instance = "GPIO_INT_XBAR_SOC_TIMESYNC_XBAR1_1";

soc_timesync_xbar13.xbarOutput          = "GPIO_INT_XBAR_GPIO_MUX_95";
soc_timesync_xbar13.instance            = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_4";
soc_timesync_xbar13.$name               = "CONFIG_GPIO95_SYNCEV12_CAP2";
soc_timesync_xbar13.xbarConfig.$name    = "CONFIG_GPIO_INT_XBAR2";
soc_timesync_xbar13.xbarConfig.instance = "GPIO_INT_XBAR_SOC_TIMESYNC_XBAR1_2";

soc_timesync_xbar14.xbarOutput          = "GPIO_INT_XBAR_GPIO_MUX_96";
soc_timesync_xbar14.instance            = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_5";
soc_timesync_xbar14.$name               = "CONFIG_GPIO96_SYNCEV13_CAP3";
soc_timesync_xbar14.xbarConfig.$name    = "CONFIG_GPIO_INT_XBAR3";
soc_timesync_xbar14.xbarConfig.instance = "GPIO_INT_XBAR_SOC_TIMESYNC_XBAR1_3";

soc_timesync_xbar15.xbarOutput          = "GPIO_INT_XBAR_GPIO_MUX_92";
soc_timesync_xbar15.instance            = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_6";
soc_timesync_xbar15.$name               = "CONFIG_GPIO92_SYNCEV14_CAP4";
soc_timesync_xbar15.xbarConfig.$name    = "CONFIG_GPIO_INT_XBAR4";
soc_timesync_xbar15.xbarConfig.instance = "GPIO_INT_XBAR_SOC_TIMESYNC_XBAR1_4";

soc_timesync_xbar16.xbarOutput          = "GPIO_INT_XBAR_GPIO_MUX_87";
soc_timesync_xbar16.instance            = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_7";
soc_timesync_xbar16.$name               = "CONFIG_GPIO87_SYNCEV15_CAP5";
soc_timesync_xbar16.xbarConfig.$name    = "CONFIG_GPIO_INT_XBAR5";
soc_timesync_xbar16.xbarConfig.instance = "GPIO_INT_XBAR_SOC_TIMESYNC_XBAR1_5";
